app/Models/RequestModel.php

    public function get_all_requests(){
        $builder = $this->db->table('tblrequest_summary a');
        $builder->select('a.*,b.name as reqtypename, c.name as reqcatname,d.*');
        $builder->join('tblrequest_types b', 'b.requestcode = a.requestcode', 'left');
        $builder->join('tblrequest_category c', 'c.name = b.requestcategory', 'left');
        $builder->join('tblusers d', 'd.userid = a.requestedby', 'left');
        $builder->orderBy('date_created','DESC');
        $builder = $builder->get();

        return $builder->getResultArray();
---
SELECT *
FROM `tblrequest_category`
SELECT *
FROM `tblrequest_types`
SELECT `a`.*, `b`.`name` as `reqtypename`, `c`.`name` as `reqcatname`, `d`.*
FROM `tblrequest_summary` `a`
LEFT JOIN `tblrequest_types` `b` ON `b`.`requestcode` = `a`.`requestcode`
LEFT JOIN `tblrequest_category` `c` ON `c`.`name` = `b`.`requestcategory`
LEFT JOIN `tblusers` `d` ON `d`.`userid` = `a`.`requestedby`
ORDER BY `date_created` DESC
SELECT *
FROM `tblrequest_types`
WHERE `requestcode` = 'ICTCONN'